Tekla.Structures.Identifier
The Identifier class represents an identifier that holds information
about the identifier number of an object.

Tekla.Structures.Identifier.ID
The identifier number.
If the ID value is set manually, the GUID is initialized to Guid.Empty and the identification is done based on the ID.

Tekla.Structures.Identifier.Id2
Secondary identifier.

Tekla.Structures.Identifier.ID2
The sub identifier number.
If the subID value is set manually, the GUID is initialized to Guid.Empty and the identification is done based on the ID.

Tekla.Structures.Identifier.GUID
The object's globally unique identifier.
If the GUID value is set manually, the ID is initialized to 0 and the identification is done based on the GUID.

Tekla.Structures.Identifier.#ctor
Constructs an empty identifier.

Tekla.Structures.Identifier.#ctor(System.Int32)
Constructs an identifier with the given ID.
id: The ID to be used.

Tekla.Structures.Identifier.#ctor(System.Guid)
Constructs an identifier with the given GUID.
guid: The GUID to be used.

Tekla.Structures.Identifier.#ctor(System.Int32,System.Int32,System.Guid)
Constructs an identifier with the given GUID.
id2:
id:
guid: The GUID to be used.

Tekla.Structures.Identifier.#ctor(System.Int32,System.Int32,System.String)
Constructs an identifier with the given GUID string.
Remarks: The guid string is lazily converted to actual Guid object when needed.
id2:
id:
guid: The GUID string to be used.

Tekla.Structures.Identifier.#ctor(System.String)
Constructs an identifier with the given GUID string.
guid: The GUID to be used.

Tekla.Structures.Identifier.GetIdentifierByGuidFromModel(System.String)
Returns an identifier instance that has the given GUID in the model.
guid: The GUID to look for in the model.
Returns: The identifier of the GUID, or null if not found.

Tekla.Structures.Identifier.ToString
Returns the integer ID as a string.
Returns: The integer ID as a string.

Tekla.Structures.Identifier.Equals(Tekla.Structures.Identifier)
Compares the identifier with another identifier instance.
otherIdentifier: The identifier to compare with.
Returns: True if the identifiers are equal, false otherwise.

Tekla.Structures.Identifier.Equals(System.Object)
Compares the identifier with another object instance.
otherObject: The object to compare with.
Returns: True if the objects are equal, false otherwise.

Tekla.Structures.Identifier.GetHashCode
Gets the hash number of the identifier.
Returns: The hashed number.

Tekla.Structures.Identifier.IsValid
Returns true if the identifier seems to be valid.
The validation is done based on the ID or GUID property.
Returns: True if the identifier seems to be valid.

Tekla.Structures.Identifier.SetGuid(System.Guid)
Sets GUID without resetting ID.
Returns: True if the identifier seems to be valid.